atmosphere/tutorials/ce1/T400_NO_AMR/0/ph_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ph_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
1024
(
1780.51
1772.91
1758.43
1738.37
1714.44
1688.49
1662.26
1637.13
...
)
;

boundaryField
{
    top
    {
        type            fixedFluxPressure;
        gradient        nonuniform List<scalar> 
64
(
-4.29394
-4.29441
-4.29532
-4.29658
-4.2981
-4.29977
-4.3015
-4.30319
...
)
;
        value           nonuniform List<scalar> 
64
(
-14268.3
-14258.8
-14240.8
-14215.7
-14185.3
-14151.9
-14117.4
-14083.7
...
)
;
    }
    bottom
    {
        type            fixedFluxPressure;
        gradient        uniform -0;
        value           nonuniform List<scalar> 
64
(
1780.51
1772.91
1758.43
1738.37
1714.44
1688.49
1662.26
1637.13
...
)
;
    }
    left
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
16
(
1780.51
1641.38
1370.22
1035.01
728.114
408.788
-56.3707
-841.082
-2056.71
-3666.93
-5489.12
-7280.15
-8836.46
-10275.7
-11802.1
-13409.5
)
;
    }
    right
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
16
(
1490.28
1343.69
1056.22
633.548
81.2674
-595.067
-1389.96
-2297.98
-3313.73
-4431.9
-5647.22
-6954.49
-8348.57
-9824.36
-11376.8
-13001.1
)
;
    }
    frontandback
    {
        type            empty;
    }
}


// ************************************************************************* //
